Ran Plan for dir: `self-infra` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/henrypham67/atlantis/2/default/self-infra/default.tfplan"' in '/home/atlantis/.atlantis/repos/henrypham67/atlantis/2/default/self-infra': exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # tls_private_key.my_key will be created
  + resource "tls_private_key" "my_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_key = (sensitive value)
╷
│ Error: No valid credential sources found
│ 
│   with provider["registry.terraform.io/hashicorp/aws"],
│   on providers.tf line 10, in provider "aws":
│   10: provider "aws" {
│ 
│ Please see https://registry.terraform.io/providers/hashicorp/aws
│ for more information about providing credentials.
│ 
│ Error: failed to refresh cached credentials, no EC2 IMDS role found,
│ operation error ec2imds: GetMetadata, request canceled, context deadline
│ exceeded
│ 
╵

```
</details>